In [57]:
import numpy as np
import pandas as pd
from datetime import datetime

In [58]:
file_path = r'C:\Users\SanthoshS\Desktop\DataEngineering\DataWarehouse\raw_schema\raw_employee.csv'
employee = pd.read_csv(file_path)
employee.head()

,employee_id,employee_name,current_role,skills,dateofbirth,dateofjoining,email,mobile_number,Address
0,254,Brian Jackson,senior data engineer,Data Lakes,1960-03-19,2022-02-16,georgeangela@example.net,769.820.3225x835,"715 Cunningham Forges Apt. 824, West Brandonsi..."
1,219,Mark Nielsen,senior data scientist,Natural Language Processing,1985-06-05,2010-06-30,milesmary@example.org,7635554079,"31583 Eric Mill Suite 677, Riveraton, OK 07085"
2,134,David Anderson,junior data analyst,Excel,1992-01-14,2006-05-25,ajones@example.net,724.899.0763x041,"PSC 4715, Box 9334, APO AA 03780"
3,295,Tyler Allen,senior software engineer,DevOps,1965-09-24,2008-11-07,dianamontes@example.net,3927339776,"2816 Stephen Island Suite 455, Sarahborough, S..."
4,432,Trevor Torres,senior software engineer,DevOps,1972-03-03,2019-09-15,devon53@example.org,001-707-865-5738,"742 Perez Stream Apt. 654, Rodriguezville, IN ..."

# Data Cleaning

 Remove the duplicates

In [59]:
# Print the column names to identify the correct name
print("Columns in DataFrame:", employee.columns)

# Count the number of entries in the correct column before dropping duplicates
print("Count of 'employee_id' before dropping duplicates:", employee['employee_id'].count())

# Drop duplicates based on all columns
employee = employee.drop_duplicates()

# Count the number of entries in the correct column after dropping duplicates
print("Count of 'employee_id' after dropping duplicates:", employee['employee_id'].count())

Columns in DataFrame: Index(['employee_id', 'employee_name', 'current_role', 'skills', 'dateofbirth',
       'dateofjoining', 'email', 'mobile_number', 'Address'],
      dtype='object')
Count of 'employee_id' before dropping duplicates: 500
Count of 'employee_id' after dropping duplicates: 500

 To identify the null

In [60]:
employee.isnull().sum()

employee_id      0
employee_name    0
current_role     0
skills           0
dateofbirth      0
dateofjoining    0
email            0
mobile_number    0
Address          0
dtype: int64

 Data type conversion

In [61]:
employee.dtypes

employee_id       int64
employee_name    object
current_role     object
skills           object
dateofbirth      object
dateofjoining    object
email            object
mobile_number    object
Address          object
dtype: object

In [62]:
employee['dateofbirth'] = pd.to_datetime(employee['dateofbirth'])
employee.dtypes

employee_id               int64
employee_name            object
current_role             object
skills                   object
dateofbirth      datetime64[ns]
dateofjoining            object
email                    object
mobile_number            object
Address                  object
dtype: object

In [63]:
employee['dateofjoining'] = pd.to_datetime(employee['dateofjoining'])
employee.dtypes

employee_id               int64
employee_name            object
current_role             object
skills                   object
dateofbirth      datetime64[ns]
dateofjoining    datetime64[ns]
email                    object
mobile_number            object
Address                  object
dtype: object

In [64]:
employee['mobile_number'] = employee['mobile_number'].str.replace(r'\D', '', regex=True)

# Convert 'mobile_number' to numeric type, coercing errors
employee['mobile_number'] = pd.to_numeric(employee['mobile_number'], errors='coerce')

# Drop rows with NaN values in 'mobile_number' if any exist
employee = employee.dropna(subset=['mobile_number'])

# Convert to integer type
employee['mobile_number'] = employee['mobile_number'].astype(int)

# Check the data types after conversion
print("\nData Types After Conversion:")
print(employee.dtypes)

Data Types After Conversion:
employee_id               int64
employee_name            object
current_role             object
skills                   object
dateofbirth      datetime64[ns]
dateofjoining    datetime64[ns]
email                    object
mobile_number             int64
Address                  object
dtype: object

## Data Transformation

In [65]:
employee.head()

,employee_id,employee_name,current_role,skills,dateofbirth,dateofjoining,email,mobile_number,Address
0,254,Brian Jackson,senior data engineer,Data Lakes,1960-03-19,2022-02-16,georgeangela@example.net,7698203225835,"715 Cunningham Forges Apt. 824, West Brandonsi..."
1,219,Mark Nielsen,senior data scientist,Natural Language Processing,1985-06-05,2010-06-30,milesmary@example.org,7635554079,"31583 Eric Mill Suite 677, Riveraton, OK 07085"
2,134,David Anderson,junior data analyst,Excel,1992-01-14,2006-05-25,ajones@example.net,7248990763041,"PSC 4715, Box 9334, APO AA 03780"
3,295,Tyler Allen,senior software engineer,DevOps,1965-09-24,2008-11-07,dianamontes@example.net,3927339776,"2816 Stephen Island Suite 455, Sarahborough, S..."
4,432,Trevor Torres,senior software engineer,DevOps,1972-03-03,2019-09-15,devon53@example.org,17078655738,"742 Perez Stream Apt. 654, Rodriguezville, IN ..."

In [66]:
now = pd.Timestamp(datetime.now())

# Calculate years of experience
employee['yearofexperience'] = (now - employee['dateofjoining']).dt.days // 365

In [67]:
employee.head()

,employee_id,employee_name,current_role,skills,dateofbirth,dateofjoining,email,mobile_number,Address,yearofexperience
0,254,Brian Jackson,senior data engineer,Data Lakes,1960-03-19,2022-02-16,georgeangela@example.net,7698203225835,"715 Cunningham Forges Apt. 824, West Brandonsi...",2
1,219,Mark Nielsen,senior data scientist,Natural Language Processing,1985-06-05,2010-06-30,milesmary@example.org,7635554079,"31583 Eric Mill Suite 677, Riveraton, OK 07085",14
2,134,David Anderson,junior data analyst,Excel,1992-01-14,2006-05-25,ajones@example.net,7248990763041,"PSC 4715, Box 9334, APO AA 03780",18
3,295,Tyler Allen,senior software engineer,DevOps,1965-09-24,2008-11-07,dianamontes@example.net,3927339776,"2816 Stephen Island Suite 455, Sarahborough, S...",15
4,432,Trevor Torres,senior software engineer,DevOps,1972-03-03,2019-09-15,devon53@example.org,17078655738,"742 Perez Stream Apt. 654, Rodriguezville, IN ...",5

In [68]:
employee.to_csv("prep_employee.csv", index=False)

In [69]:
df= pd.read_csv('prep_employee.csv')
df.head

<bound method NDFrame.head of      employee_id    employee_name              current_role  \
0            254    Brian Jackson      senior data engineer
1            219     Mark Nielsen     senior data scientist
2            134   David Anderson       junior data analyst
3            295      Tyler Allen  senior software engineer
4            432    Trevor Torres  senior software engineer
..           ...              ...                       ...
495           63   Cynthia Knight  senior software engineer
496          249       Paul Myers       senior data analyst
497          274     James Hanson      senior data engineer
498          224  Shelly Davidson       senior data analyst
499           33     Joseph Jones      senior data engineer

                          skills dateofbirth dateofjoining  \
0                     Data Lakes  1960-03-19    2022-02-16
1    Natural Language Processing  1985-06-05    2010-06-30
2                          Excel  1992-01-14    2006-05-25
3                         DevOps  1965-09-24    2008-11-07
4                         DevOps  1972-03-03    2019-09-15
..                           ...         ...           ...
495              Cloud Computing  1955-04-27    2019-04-12
496                   Statistics  1992-01-22    2019-01-18
497                   Data Lakes  1974-11-29    2012-01-11
498                   Statistics  1960-08-11    2019-09-20
499                       Hadoop  1974-06-22    2021-01-20

                        email   mobile_number  \
0    georgeangela@example.net   7698203225835
1       milesmary@example.org      7635554079
2          ajones@example.net   7248990763041
3     dianamontes@example.net      3927339776
4         devon53@example.org     17078655738
..                        ...             ...
495       hduncan@example.com   4253450321783
496   elizabeth51@example.org      9315120550
497      sherry77@example.org  25193045636058
498         krice@example.com   2839991301035
499  josephpeters@example.com   7463005329845

                                               Address  yearofexperience
0    715 Cunningham Forges Apt. 824, West Brandonsi...                 2
1       31583 Eric Mill Suite 677, Riveraton, OK 07085                14
2                     PSC 4715, Box 9334, APO AA 03780                18
3    2816 Stephen Island Suite 455, Sarahborough, S...                15
4    742 Perez Stream Apt. 654, Rodriguezville, IN ...                 5
..                                                 ...               ...
495              892 Knight Cove, West Robin, VI 52380                 5
496  104 Pamela Highway Apt. 476, Terrymouth, IA 14098                 5
497  54951 Edward Fort Suite 010, Hansonberg, NY 80756                12
498  26293 Adam Centers Apt. 353, Josephtown, WI 16753                 5
499                   PSC 0049, Box 6326, APO AP 91158                 3

[500 rows x 10 columns]>

In [70]:
employee.to_csv("prep_employee.csv", index=False)